# Brew taps and settings.
tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Configuration
cask_args appdir: '/Applications'

# Brew casks.
# cask "alacritty"
# cask "alfred"
# cask "atom"
# cask "avast-security"
# cask "bibdesk"
# cask "bloomrpc"
# cask "blender"
# cask "brave-browser"
# cask "dbeaver-community"
cask "discord"
cask "docker"
cask "drawio"
# cask "dropbox"
# cask "cyberduck"
cask "firefox"
# cask "font-hack-nerd-font"
# cask "gimp"
# cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
# cask "insomnia"
# cask "intellij-idea"
cask "iterm2"
cask "mactex"
cask "microsoft-teams"
# cask "mysqlworkbench"
# cask "openconnect-gui"
# cask "opera"
cask "pgadmin4"
cask "postman"
# cask "pycharm-ce"
cask "r"
cask "another-redis-desktop-manager"
# cask "robo-3t"
cask "rstudio"
cask "slack"
# cask "skim"
# cask "skype"
# cask "steam"
# cask "sublime-text"
# cask "texmaker"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "vlc"
# cask "virtualbox"
cask "visual-studio-code"
cask "webex"
cask "whatsapp"
# cask "wkhtmltopdf"
# cask "unetbootin"
# cask "xquartz"
cask "zoom"

# Terminal tools.
# brew "ack"
# brew "ag"
brew "awscli"
# brew "bat"
# brew "cloc"
# brew "deno"
# brew "docker-compose"
brew "ffmpeg"
# brew "eslint"
# brew "fzf"
# brew "glances"
# brew "gnu-sed"
# brew "gource"
# brew "gpg"
brew "gzip"
# brew "httpie"
# brew "htop"
# brew "ifuse"
# brew "imagemagick"
# brew "jq"
# brew "neofetch"
brew "nmap"
# brew "openconnect"
brew "openjdk"
brew "openssl"
# brew "qrencode"
# brew "ranger"
# brew "ripgrep"
# brew "speedtest-cli"
brew "spoof-mac"
brew "telnet"
brew "tor"
# brew "thefuck"
brew "tree"
brew "wget"
brew "youtube-dl"

# Development environment.
brew "bash"
brew "neovim"
brew "tmux"
brew "zsh"

# Development tools.
# brew "angular-cli"
# brew "binaryen"
# brew "cmake"
# brew "cocoapods"
# brew "ctags"
# brew "editorconfig"
# brew "emscripten"
# brew "firebase-cli"
# brew "flyway"
# brew "gcc"
# brew "gdb"
brew "git"
brew "git-flow"
brew "gitmoji"
# brew "gnuplot"
# brew "go"
brew "jenv"
# brew "kotlin"
# brew "kubernetes-cli"
# brew "maven"
# brew "node"
brew "nvm"
# brew "openvpn"
# brew "prettier"
# brew "php"
brew "protobuf"
brew "pv"
brew "pyenv"
# brew "rust"
# brew "sbt"
# brew "scala"
# brew "terraform"
# brew "tig"
# brew "typescript"
# brew "watchman"
brew "yarn"
