# Brew taps and settings.
tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-fonts"
cask_args appdir: '/Applications'

# Brew casks.
cask "atom"
cask "avast-security"
cask "bibdesk"
cask "blender"
cask "brave-browser"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "cyberduck"
cask "firefox"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "mactex"
cask "microsoft-teams"
cask "mysqlworkbench"
cask "opera"
cask "pgadmin4"
cask "postman"
cask "pycharm-ce"
cask "r"
cask "robo-3t"
cask "rstudio"
cask "slack"
cask "skype"
cask "steam"
cask "sublime-text"
cask "texmaker"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "vlc"
cask "visual-studio-code"
cask "webex-meetings"
cask "webex-teams"
cask "whatsapp"
cask "wkhtmltopdf"
cask "unetbootin"
cask "zoom"

# Terminal tools.
brew "ack"
brew "ag"
brew "bat"
brew "deno"
brew "ffmpeg"
brew "fzf"
brew "glances"
brew "gource"
brew "gpg"
brew "gzip"
brew "httpie"
brew "htop"
brew "ifuse"
brew "jq"
brew "nmap"
brew "openssl"
brew "ripgrep"
brew "speedtest-cli"
brew "telnet"
brew "tor"
brew "thefuck"
brew "tree"
brew "wget"
brew "youtube-dl"

# Development environment.
brew "bash"
brew "neovim"
brew "tmux"
brew "zsh"

# Development tools.
brew "angular-cli"
brew "binaryen"
brew "cmake"
brew "ctags"
brew "editorconfig"
brew "emscripten"
brew "firebase-cli"
brew "flyway"
brew "gcc"
brew "gdb"
brew "git"
brew "git-flow"
brew "gitmoji"
brew "gnuplot"
brew "go"
brew "kotlin"
brew "kubernetes-cli"
brew "maven"
brew "node"
brew "nvm"
brew "openvpn"
brew "php"
brew "pv"
brew "python3"
brew "rust"
brew "sbt"
brew "scala"
brew "terraform"
brew "tig"
brew "typescript"
brew "watchman"
brew "yarn"
